/*************************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-18                                                                   *
*  版本: master_482d3f                                                                *
*  功能:                                                                              *
*   - 任务状态                                                                        *
*//************************************************************************************/

namespace UFrame.Tasks
{
    public enum TaskStatus
    {
        Free,
        Waiting,
        Running,
        Completed,
        Canceled,
    }
}
