/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 引用接口                                                                        *
*//************************************************************************************/

using System;

namespace UFrame.BridgeUI
{
    public interface IClassReference
    {
        Type LoadViewScriptType();
    }
}
