/*************************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-18                                                                   *
*  版本: master_482d3f                                                                *
*  功能:                                                                              *
*   - 表行信息                                                                        *
*//************************************************************************************/
using System.Collections.Generic;
using System.IO;
using System.Text;

namespace UFrame.TableCfg
{
   
}
