/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 关闭规则                                                                        *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    [System.Flags]
    public enum CloseRule
    {
        DestroyNoraml = 0,//普通销毁
        DestroyImmediate = 1,//快速销毁并从内存中清除
        DestroyDely = 2,//延迟销毁
        HideGameObject = 3//缓存文件,仅当场景切换时销毁
    }
}
