/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 隐藏规则                                                                        *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    [System.Flags]
    public enum HideRule
    {
        HideGameObject = 0,//直接隐藏自己
        AlaphGameObject = 1,//隐藏自己的可见物体
    }
}
