/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 加载方式                                                                        *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    [System.Flags]
    public enum LoadType
    {
        DirectLink = 1,
        Resources = 1<<1,
        Bundle = 1<<2,
    }
}
