/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 互斥规则                                                                        *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    //互斥关系
    public enum MutexRule
    {
        NoMutex,//不排斥
        SameParentAndLayer,//排斥同父级中的同层级
        SameLayer,  //排斥同层级
    }
}
