/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 父级显示方式                                                                    *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    public enum ParentShow
    {
        NoChange,//不改变父级状态
        Hide,//隐藏父级(在本面板关闭时打开)
        Destroy,//销毁父级(接管因为父级面关闭的面板)
    }
}
