/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 窗口显示类型                                                                    *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    /// <summary>
    /// 基本的窗口类型（觉得能否多开）
    /// </summary>
    [System.Flags]
    public enum UIFormType
    {
        Fixed = 0,//固定窗口(只能打开单个)
        DragAble = 1,//可拖拽(可以打开多个小窗体)
        HeadBar = 2,//没有关闭按扭(只有场景跳转时关闭)
    }
}
