/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 层级显示类型                                                                    *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    /// <summary>
    /// 基本层级类型（绝对层级）
    /// </summary>
    [System.Flags]
    public enum UILayerType
    {
        Base = 0,//最低层，可以被任何界面复盖
        Pop = 1,//弹窗层，高于Base
        Tip = 2,//提示层，一般没有关闭按扭
        Mask = 3,//遮罩层，用于全屏遮罩
        Warning = 4//警示层，程序状态警告
    }

}
