/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 动态遮罩                                                                        *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    public enum UIMask
    {
        None,                       //无遮罩
        Normal,                     //普通
        ClickClose,                 //点击关闭
        OptionalPenetration,        //选择性穿透
    }
}
