/*************************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-18                                                                   *
*  版本: master_482d3f                                                                *
*  功能:                                                                              *
*   - 资源加载方式                                                                    *
*//************************************************************************************/

namespace UFrame.Source
{
    /// <summary>
    /// 资源加载方式
    /// </summary>
    public enum SourceLoadType
    {
        None,
        Resource,//开发过程中
        AssetBundle,//发布后
        FileIO,//发布后
    }
}
