/***********************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-24                                                                   *
*  版本: master_b9fdd5                                                                *
*  功能:                                                                              *
*   - 接收数据接口                                                                    *
*//************************************************************************************/

namespace UFrame.BridgeUI
{
    public interface IDataReceiver
    {
        void HandleData(object data);
    }
}
