/*************************************************************************************//*
*  作者: 邹杭特                                                                       *
*  时间: 2021-04-18                                                                   *
*  版本: master_482d3f                                                                *
*  功能:                                                                              *
*   - 游戏状态监听                                                                    *
*//************************************************************************************/

namespace UFrame
{
    public interface IGameStateWatcher
    {
        void SetGameEvent(int gameEvent);
	}
}